package ru.mephi.head2.Lab12;

/*
Создайте исходный файл H e ll o W o r l d . ja v a , где класс H e ll o W o r l d объявляется в пакете c h O l. s e c O l.
 Разметите его в каком-нибудь каталоге, но только не в подкаталоге c h O l/ s e c O l. Выполните из этого каталога команду j a v a c
H e llo W o r ld . j a v a . Получите ли вы в итоге файл класса и где именно? Затем
выполните команду j a v a H e llo W o rld . Что при этом произойдет и почему?
(Подсказка: выполните команду j a v a p H e llo W o rld и проанализируйте полученное предупреждающее сообщение.)
 И наконец, попробуйте выполнить команду j a v a c - d . H e llo W o rld . j a v a . Почему такой способ лучше?
 */


public class Lab12 {
}
